ConnectTest/src/DataProcessors/ОтправитьПуш/ОтправитьПуш.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОтправитьПуш</name>
</mdclass:DataProcessor>

ConnectTest/src/InformationRegisters/ЗарегистрированныеУстройства/ЗарегистрированныеУстройства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗарегистрированныеУстройства</name>
  <resources>
    <name>ВерсияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>МодельУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТокенУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Токен</name>
    <type>
      <types>CatalogRef.Токены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConnectTest/src/InformationRegisters/СертификатыПриложений/СертификатыПриложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СертификатыПриложений</name>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПриложения</name>
    <type>
      <types>EnumRef.ВидыПриложений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОперационнаяСистема</name>
    <comment>Операционная система устройства</comment>
    <type>
      <types>EnumRef.ОперационныеСистемы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Сети</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConnectTest/src/Enums/ОперационныеСистемы/ОперационныеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперационныеСистемы</name>
  <enumValues>
    <name>Android</name>
  </enumValues>
  <enumValues>
    <name>iOS</name>
  </enumValues>
  <enumValues>
    <name>Web</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Catalogs/Токены/Токены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Токены</name>
  <attributes>
    <name>ВидПриложения</name>
    <type>
      <types>EnumRef.ВидыПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистема</name>
    <comment>Операционная система устройства</comment>
    <type>
      <types>EnumRef.ОперационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Сети</types>
    </type>
  </attributes>
  <attributes>
    <name>Холдинг</name>
    <type>
      <types>CatalogRef.Холдинги</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>CatalogRef.ЧасовыеПояса</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/DataProcessors/ОтправитьПуш/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ОтправитьПуш(Команда)
	ОтправитьПушНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьПушНаСервере()
	
	//--Подготовка заголовка пуш сообщения
	МассивСловНовый	= Новый Массив;
	МассивСлов		= СтрРазделить(пЗаголовок, " ");	
	Для Каждого Слово Из МассивСлов Цикл		
		Если Найти(Слово, "#emj") > 0 Тогда			
			Слово	= РаскодироватьСтроку(СтрЗаменить(Слово, "#emj", ""), СпособКодированияСтроки.КодировкаURL);
		КонецЕсли;
		МассивСловНовый.Добавить(Слово);
	КонецЦикла;	
	ЗаголовокПуш	= СтрСоединить(МассивСловНовый, " ");
	
	//--Подготовка текста пуш сообщения
	//НЕ ЗАБЫТЬ ЧТО СМАЙЛИК ДОЛЖЕН БЫТЬ В ФОРМАТЕ %F0%9F%8F%8B%20
	МассивСловНовый	= Новый Массив;
	МассивСлов		= СтрРазделить(Текст, " ");	
	Для Каждого Слово Из МассивСлов Цикл		
		Если Найти(Слово, "#emj") > 0 Тогда			
			Слово	= РаскодироватьСтроку(СтрЗаменить(Слово, "#emj", ""), СпособКодированияСтроки.КодировкаURL);
		КонецЕсли;
		МассивСловНовый.Добавить(Слово);
	КонецЦикла;	
	ТекстПуш	= СтрСоединить(МассивСловНовый, " ");
		
	ЗаписьJSON		= Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
		
	пЗапрос	= Новый Запрос;
	пЗапрос.Текст	= "ВЫБРАТЬ
	             	  |	Токены.Ссылка КАК Токен,
	             	  |	ЕСТЬNULL(ЗарегистрированныеУстройства.ДатаЗаписи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗаписи,
	             	  |	ЕСТЬNULL(ЗарегистрированныеУстройства.ТокенУстройства, """") КАК ТокенУстройства,
	             	  |	ВЫБОР
	             	  |		КОГДА Токены.ОперационнаяСистема = ЗНАЧЕНИЕ(Перечисление.ОперационныеСистемы.Android)
	             	  |			ТОГДА ""GCM""
	             	  |		ИНАЧЕ ""APNS""
	             	  |	КОНЕЦ КАК ТипПодписчика,
	             	  |	Токены.Сеть КАК Сеть,
	             	  |	Токены.ВидПриложения КАК ВидПриложения,
	             	  |	Токены.ОперационнаяСистема КАК ОперационнаяСистема
	             	  |ПОМЕСТИТЬ ВТ
	             	  |ИЗ
	             	  |	Справочник.Токены КАК Токены
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеУстройства КАК ЗарегистрированныеУстройства
	             	  |		ПО (ЗарегистрированныеУстройства.Токен = Токены.Ссылка)
	             	  |ГДЕ
	             	  |	Токены.Пользователь В(&МассивПользователей)
	             	  |	И Токены.Ссылка В(&МассивТокенов)
	             	  |	И Токены.ДатаБлокировки = ДАТАВРЕМЯ(1, 1, 1)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ВТ.Токен КАК Токен,
	             	  |	ВТ.ДатаЗаписи КАК ДатаЗаписи,
	             	  |	ВТ.ТокенУстройства КАК ТокенУстройства,
	             	  |	ВТ.ТипПодписчика КАК ТипПодписчика,
	             	  |	ВТ.ОперационнаяСистема КАК ОперационнаяСистема,
	             	  |	ЕСТЬNULL(СертификатПриложенияДляСети.Сертификат, СертификатПриложенияОбщий.Сертификат) КАК Сертификат
	             	  |ИЗ
	             	  |	ВТ КАК ВТ
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СертификатыПриложений КАК СертификатПриложенияДляСети
	             	  |		ПО ВТ.Сеть = СертификатПриложенияДляСети.Сеть
	             	  |			И ВТ.ВидПриложения = СертификатПриложенияДляСети.ВидПриложения
	             	  |			И ВТ.ОперационнаяСистема = СертификатПриложенияДляСети.ОперационнаяСистема
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СертификатыПриложений КАК СертификатПриложенияОбщий
	             	  |		ПО (СертификатПриложенияОбщий.Сеть = ЗНАЧЕНИЕ(Справочник.Сети.ПустаяСсылка))
	             	  |			И ВТ.ВидПриложения = СертификатПриложенияОбщий.ВидПриложения
	             	  |			И ВТ.ОперационнаяСистема = СертификатПриложенияОбщий.ОперационнаяСистема";
	
	пЗапрос.УстановитьПараметр("МассивПользователей", Пользователи.Выгрузить().ВыгрузитьКолонку("Пользователь"));
	
	МассивТокенов	= Пользователи.Выгрузить().ВыгрузитьКолонку("Токен");
	Если МассивТокенов.Количество() = 0 Тогда
		пЗапрос.Текст	= СтрЗаменить(пЗапрос.Текст, "И Токены.Ссылка В (&МассивТокенов)", "");	
	Иначе
		пЗапрос.УстановитьПараметр("МассивТокенов", МассивТокенов);
	КонецЕсли;
	
	Выборка	= пЗапрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТокенУстройства <> "" Тогда
			Уведомление				= Новый ДоставляемоеУведомление;
			Уведомление.Заголовок	= ЗаголовокПуш;
			Уведомление.Текст		= ТекстПуш;
			Уведомление.Данные		= РаботаССообщениями.ДанныеPush(action, objectId, objectType, noteId);
			Уведомление.ЗвуковоеОповещение = ?(БезЗвука, ЗвуковоеОповещение.Нет, ЗвуковоеОповещение.ПоУмолчанию);
			Уведомление.Получатели.Добавить(РаботаССообщениями.ПолучательPush(Выборка.ТокенУстройства, Выборка.ТипПодписчика));
			ИсключенныеПолучатели	= Новый Массив;
			ПроблемыОтправкиДоставляемыхУведомлений	 = Новый Массив;
			ОтправкаДоставляемыхУведомлений.Отправить(Уведомление, ОбщегоНазначенияПовторноеИспользование.ДанныеАутентификации(Выборка.ОперационнаяСистема, Выборка.Сертификат),ИсключенныеПолучатели,, ПроблемыОтправкиДоставляемыхУведомлений);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
